performance/axis2/data/receiveSimpleEvents-10.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveSimpleEvents xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input><ns1:sequenceNumber>0</ns1:sequenceNumber><ns1:timestamp>0.0</ns1:timestamp><ns1:message>Message #0</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>1</ns1:sequenceNumber><ns1:timestamp>1.0</ns1:timestamp><ns1:message>Message #1</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>2</ns1:sequenceNumber><ns1:timestamp>1.4142135623730951</ns1:timestamp><ns1:message>Message #2</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>3</ns1:sequenceNumber><ns1:timestamp>1.7320508075688772</ns1:timestamp><ns1:message>Message #3</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>4</ns1:sequenceNumber><ns1:timestamp>2.0</ns1:timestamp><ns1:message>Message #4</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>5</ns1:sequenceNumber><ns1:timestamp>2.23606797749979</ns1:timestamp><ns1:message>Message #5</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>6</ns1:sequenceNumber><ns1:timestamp>2.449489742783178</ns1:timestamp><ns1:message>Message #6</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>7</ns1:sequenceNumber><ns1:timestamp>2.6457513110645907</ns1:timestamp><ns1:message>Message #7</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>8</ns1:sequenceNumber><ns1:timestamp>2.8284271247461903</ns1:timestamp><ns1:message>Message #8</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>9</ns1:sequenceNumber><ns1:timestamp>3.0</ns1:timestamp><ns1:message>Message #9</ns1:message></ns1:input></ns1:receiveSimpleEvents></soapenv:Body></soapenv:Envelope>